<a href="https://colab.research.google.com/github/Elmira42/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/Copy_of_LS_DS_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [42]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-10-31 13:48:28--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.113.181
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.113.181|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  65.7MB/s    in 3.0s

2019-10-31 13:48:31 (65.7 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [43]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [44]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01/instacart_2017_05_01

In [45]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [46]:
from IPython.display import display, Image
url = 'https://cdn-images-1.medium.com/max/1600/1*vYGFQCafJtGBBX5mbl0xyw.png'
example = Image(url=url, width=600)
# Brings up the DataFrame
display(example)

In [47]:
!ls -lh *.csv
# Brings up all the CSV filenames

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

In [0]:
import pandas as pd

In [49]:
aisles = pd.read_csv('aisles.csv')
print(aisles.shape)# Brings up the aisles dataframe
aisles.head()

(134, 2)

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [50]:
departments = pd.read_csv('departments.csv')
print(departments.shape)# Brings up the departments dataframe
departments.head()

(21, 2)

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [51]:
order_products__prior = pd.read_csv('order_products__prior.csv')
print(order_products__prior.shape)# Brings up prior products dataframe
order_products__prior.head()

(32434489, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [52]:
order_products__train = pd.read_csv('order_products__train.csv')
print(order_products__train.shape)# Brings up train products
order_products__train.head()

(1384617, 4)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [53]:
orders = pd.read_csv('orders.csv')
print(orders.shape)# Brings up the orders dataframe
orders.head()

(3421083, 7)

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [54]:
products = pd.read_csv('products.csv')
print(products.shape)# Brings up the products dataframe
products.head()

(49688, 4)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [55]:
order_products = pd.concat([order_products__prior, order_products__train])

print(order_products.shape)# This puts them both together to make one dataframe
order_products.head()

(33819106, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [56]:
display(example)

In [57]:
orders['user_id'] == 1#Tells wether item is equal to 1 or not

0           True
1           True
2           True
3           True
4           True
           ...
3421078    False
3421079    False
3421080    False
3421081    False
3421082    False
Name: user_id, Length: 3421083, dtype: bool

In [58]:
orders['order_number'] <=2#Tells wether the item is less than or equal to 2

0           True
1           True
2          False
3          False
4          False
           ...
3421078    False
3421079    False
3421080    False
3421081    False
3421082    False
Name: order_number, Length: 3421083, dtype: bool

In [0]:
condition = (orders['user_id'] ==1) & (orders['order_number'] <=2)#compares 
#the lists of 
#true/false values using the bitwise AND operator

In [60]:
columns = ['user_id', 
           'order_id', 
           'order_number',
           'order_dow', 
           'order_hour_of_day']
orders_subset = orders.loc[condition, columns]# Places the conditions on 
#the columns
orders_subset.head()

   user_id  order_id  order_number  order_dow  order_hour_of_day
0        1   2539329             1          2                  8
1        1   2398795             2          3                  7

In [0]:
 condition = ((order_products['order_id'] == 2539329)# Place the condition on these two items in the combined dataset  
          | (order_products['order_id'] == 2398795))
 # Place the condition on these two items in the combined dataset

In [62]:
columns = ['order_id', 'product_id', 'add_to_cart_order']
# Places the condition on these columns in the combined dataframes
order_products_subset = order_products.loc[condition, columns]
order_products_subset.head(11)# Calls the first 11 rows in these dataframes

          order_id  product_id  add_to_cart_order
22742744   2398795         196                  1
22742745   2398795       10258                  2
22742746   2398795       12427                  3
22742747   2398795       13176                  4
22742748   2398795       26088                  5
22742749   2398795       13032                  6
24076664   2539329         196                  1
24076665   2539329       14084                  2
24076666   2539329       12427                  3
24076667   2539329       26088                  4
24076668   2539329       26405                  5

In [63]:
display(example)# Shows the combined dataframe

In [64]:
merged = pd.merge(orders_subset,
                 order_products_subset, 
                 how='inner',
                 on='order_id')
merged.head(11)
# the 'on' parameter indicates a specific column that is contained in 
#*both*
# dataframes, that we will use to lookup and then copy information
# from the two dataframes into a new (singular) combined dataframe

    user_id  order_id  ...  product_id  add_to_cart_order
0         1   2539329  ...         196                  1
1         1   2539329  ...       14084                  2
2         1   2539329  ...       12427                  3
3         1   2539329  ...       26088                  4
4         1   2539329  ...       26405                  5
5         1   2398795  ...         196                  1
6         1   2398795  ...       10258                  2
7         1   2398795  ...       12427                  3
8         1   2398795  ...       13176                  4
9         1   2398795  ...       26088                  5
10        1   2398795  ...       13032                  6

[11 rows x 7 columns]

In [65]:
final = pd.merge(merged,
                 products[['product_id', 'product_name']],
                 how='left',
                 on='product_id')
final.head(500)
#Put the two columns together, and the how shows it was placed to the left

    user_id  ...                             product_name
0         1  ...                                     Soda
1         1  ...  Organic Unsweetened Vanilla Almond Milk
2         1  ...                      Original Beef Jerky
3         1  ...               Aged White Cheddar Popcorn
4         1  ...         XL Pick-A-Size Paper Towel Rolls
5         1  ...                                     Soda
6         1  ...                               Pistachios
7         1  ...                      Original Beef Jerky
8         1  ...                   Bag of Organic Bananas
9         1  ...               Aged White Cheddar Popcorn
10        1  ...                    Cinnamon Toast Crunch

[11 rows x 8 columns]

In [66]:
final = final.sort_values(by=['order_number', 'add_to_cart_order'])
final# sorts the values in these columns

    user_id  ...                             product_name
0         1  ...                                     Soda
1         1  ...  Organic Unsweetened Vanilla Almond Milk
2         1  ...                      Original Beef Jerky
3         1  ...               Aged White Cheddar Popcorn
4         1  ...         XL Pick-A-Size Paper Towel Rolls
5         1  ...                                     Soda
6         1  ...                               Pistachios
7         1  ...                      Original Beef Jerky
8         1  ...                   Bag of Organic Bananas
9         1  ...               Aged White Cheddar Popcorn
10        1  ...                    Cinnamon Toast Crunch

[11 rows x 8 columns]

In [67]:
final.columns = [column.replace('_', ' ') for column in final]
final.head(11)# Replaces the _ in column titles with white space, 
#but I am not to sure why these titles are placed this way.

    user id  ...                             product name
0         1  ...                                     Soda
1         1  ...  Organic Unsweetened Vanilla Almond Milk
2         1  ...                      Original Beef Jerky
3         1  ...               Aged White Cheddar Popcorn
4         1  ...         XL Pick-A-Size Paper Towel Rolls
5         1  ...                                     Soda
6         1  ...                               Pistachios
7         1  ...                      Original Beef Jerky
8         1  ...                   Bag of Organic Bananas
9         1  ...               Aged White Cheddar Popcorn
10        1  ...                    Cinnamon Toast Crunch

[11 rows x 8 columns]

In [68]:
display(example)

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns

In [0]:
table1 = pd.DataFrame([[np.nan, 2],
                       [16,   11],
                       [3,    1]],
                      index=['John Smith', 'Jane Doe', 'Mary Johnson'],
                      columns=['treatmenta', 'treatmentb'])
table2 = table1.T
#We just build our own imaginary dataframe with the code above.
#The light came on on the top floor.

In [71]:
table1

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [72]:
table2
#This is the same dataframe just flip flop by using table2 = table1.T

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [73]:
table1 = table1.reset_index()
table1
#It made a new column with the row index

          index  treatmenta  treatmentb
0    John Smith         NaN           2
1      Jane Doe        16.0          11
2  Mary Johnson         3.0           1

In [78]:
tidy1 = table1.melt(id_vars='index', value_vars=['treatmenta', 'treatmentb'])
tidy1
#Here this code added a variable and value column, and then placed the 
#treatments as the variables and the floats as values

          index    variable  value
0    John Smith  treatmenta    NaN
1      Jane Doe  treatmenta   16.0
2  Mary Johnson  treatmenta    3.0
3    John Smith  treatmentb    2.0
4      Jane Doe  treatmentb   11.0
5  Mary Johnson  treatmentb    1.0

In [79]:
tidy1 = tidy1.rename(columns={
    'index': 'name',
    'variable': 'trt',
    'value': 'results'
})
tidy1
# It said index it changed it name, and were it said variable it changed it 
#to trt, and were it said value it changed it to result

           name         trt  results
0    John Smith  treatmenta      NaN
1      Jane Doe  treatmenta     16.0
2  Mary Johnson  treatmenta      3.0
3    John Smith  treatmentb      2.0
4      Jane Doe  treatmentb     11.0
5  Mary Johnson  treatmentb      1.0

In [80]:
tidy1.trt = tidy1.trt.str.replace('treatment', '')
tidy1
# In the treatment column, it took away the string of trement and just 
#left the a's or b's

           name trt  results
0    John Smith   a      NaN
1      Jane Doe   a     16.0
2  Mary Johnson   a      3.0
3    John Smith   b      2.0
4      Jane Doe   b     11.0
5  Mary Johnson   b      1.0

In [81]:
table2 = table2.reset_index()
table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [83]:
tidy2 = table2.melt(id_vars='index', value_vars=['John Smith', 'Jane Doe', 
                                                 'Mary Johnson'])
tidy2
#Instead of treatmenta, and treatmentb it placed the names in the variable 
#column

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [84]:
tidy2 = tidy2.rename(columns={
    'index': 'trt',
    'variable': 'name',
    'value': 'results'
})
tidy2
#Its the same as tidy1 but you have to rearrange thins according to title

          trt          name  results
0  treatmenta    John Smith      NaN
1  treatmentb    John Smith      2.0
2  treatmenta      Jane Doe     16.0
3  treatmentb      Jane Doe     11.0
4  treatmenta  Mary Johnson      3.0
5  treatmentb  Mary Johnson      1.0

In [85]:
tidy2.trt = tidy2.trt.str.replace('treatment', '')
tidy2
#Done in the same format as tidy1

  trt          name  results
0   a    John Smith      NaN
1   b    John Smith      2.0
2   a      Jane Doe     16.0
3   b      Jane Doe     11.0
4   a  Mary Johnson      3.0
5   b  Mary Johnson      1.0

In [88]:
wide = tidy1.pivot_table(index='name', columns='trt', values='results')
wide

trt              a     b
name
Jane Doe      16.0  11.0
John Smith     NaN   2.0
Mary Johnson   3.0   1.0

In [90]:
wide = tidy2.pivot_table(index='name', columns='trt', values='results')
wide

trt              a     b
name
Jane Doe      16.0  11.0
John Smith     NaN   2.0
Mary Johnson   3.0   1.0

In [0]:
flights = sns.load_dataset('flights')

In [92]:
flights.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [94]:
flights = flights.pivot_table(index='year', columns='month')
flights

      passengers                       ...
month    January February March April  ... September October November December
year                                   ...
1949         112      118   132   129  ...       136     119      104      118
1950         115      126   141   135  ...       158     133      114      140
1951         145      150   178   163  ...       184     162      146      166
1952         171      180   193   181  ...       209     191      172      194
1953         196      196   236   235  ...       237     211      180      201
1954         204      188   235   227  ...       259     229      203      229
1955         242      233   267   269  ...       312     274      237      278
1956         284      277   317   313  ...       355     306      271      306
1957         315      301   356   348  ...       404     347      305      336
1958         340      318   362   348  ...       404     359      310      337
1959         360      342   406   396  ...       463     407      362      405
1960         417      391   419   461  ...       508     461      390      432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####